scrambletools/ESP-AVB-Wireless-AP/sdkconfig.defaults
# ESP-AVB-Bridge defaults — Waveshare ESP32-P4-WiFi6-PoE-ETH (ESP1):
# P4 host owns Ethernet + AVB stack; onboard C6 over SDIO is the Wi-Fi
# coprocessor (built from coprocessor/ via the upstream
# esp-hosted-mcu/slave example overlaid with esp_ptp_rpc).

CONFIG_IDF_TARGET="esp32p4"

# ESP1's P4 silicon is rev v1.3; same pre-v3 boot fix as the example.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_ESP_NETIF_L2_TAP=y
# Bridge needs 4 L2TAP fds per port × 2 ports + 1 for ptpd = 9 minimum.
# Default is 5; bump to the Kconfig max to keep room for future
# additions. (esp_netif's help-text says L2TAP is "currently associated
# only with Ethernet"; if Wi-Fi binding fails functionally we'll fall
# back to a netif-input-callback path on the wireless port.)
CONFIG_ESP_NETIF_L2_TAP_MAX_FDS=10

# Onboard PHY uses the same IP101 footprint as the existing example.
CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y

# Per-port topology — esp_ptp is the single source of truth. The
# matching ESP_AVB_* mirrors (NUM_PORTS, PORTn_MEDIUM_*, ROLE_BRIDGE,
# etc.) are derived in esp_avb/Kconfig.projbuild and follow these.
#   port 0: ethernet  (host_if=emac, bridged, 1 Gbps)
#   port 1: wifi      (host_if=sdio — onboard C6 over ESP-Hosted,
#                      bridged, AP, ~150 Mbps negotiated cap)
# Peer-delay on port 1 comes from 802.11 FTM (external); the AP also
# publishes gPTP FollowUpInformation via beacon Vendor IE.
CONFIG_ESP_PTP_NUM_PORTS=2
CONFIG_ESP_PTP_PORT0_MEDIUM_ETHERNET=y
CONFIG_ESP_PTP_PORT0_HOST_IF_EMAC=y
CONFIG_ESP_PTP_PORT0_TYPE_BRIDGED=y
CONFIG_ESP_PTP_PORT0_LINK_SPEED_MBPS=1000
CONFIG_ESP_PTP_PORT1_MEDIUM_WIFI=y
CONFIG_ESP_PTP_PORT1_HOST_IF_SDIO=y
CONFIG_ESP_PTP_PORT1_TYPE_BRIDGED=y
CONFIG_ESP_PTP_PORT1_WIFI_MODE_AP=y
CONFIG_ESP_PTP_PORT1_LINK_SPEED_MBPS=150

# gPTP intervals matching the example.
CONFIG_NETUTILS_PTPD_PRIORITY1=246
CONFIG_NETUTILS_PTPD_TIMEOUT_MS=10000
CONFIG_NETUTILS_PTPD_SETTIME_THRESHOLD_MS=100
CONFIG_NETUTILS_PTPD_SYNC_INTERVAL_MS=125
CONFIG_NETUTILS_PTPD_ANNOUNCE_INTERVAL_MS=1000

# AVB Lite stays advertised on the wired side; the bridge runs full
# AVB on Ethernet but Class B on Wi-Fi (Phase 5).
CONFIG_ESP_AVB_AVB_LITE_COMPLIANT=y

# ESP-Hosted SDIO host configuration for the Waveshare
# ESP32-P4-WIFI6-PoE-ETH onboard P4 ↔ C6 bus.
#
# Actual wiring (re-read from the schematic 4-bit SDIO bus, cross-wired
# between P4 host slot-1 IOMUX pins and C6 slave HW-fixed IOMUX pins):
#   Signal  C6 chip pin   P4 chip pin    Net name on schematic
#   CLK     GPIO19        GPIO18          GPIO18
#   CMD     GPIO18        GPIO19          GPIO19
#   D0      GPIO20        GPIO14          GPIO14
#   D1      GPIO21        GPIO15          GPIO15
#   D2      GPIO22        GPIO16          GPIO16
#   D3      GPIO23        GPIO17          GPIO17
# Each line has a 51 kΩ pull-up to ESP_3V3.
#
# CMD/CLK appear "swapped" between host and slave because both ICs
# place those signals on each other's nominal pins — the schematic's
# net names follow the P4 host pin numbers, not the C6 slave's.
#
# Bus width: 4-bit. ESP-Hosted's P4 defaults (slot 1, 4-bit, CMD=19,
# CLK=18, D0..D3=14..17) match this wiring, so we don't override pins.
CONFIG_ESP_HOSTED_ENABLE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y

# Peer data transfer / Custom RPC. ESP-Hosted's standard protobuf RPC
# catalogue does not expose esp_wifi_set_vendor_ie (the host-side stub
# at managed_components/.../host/api/src/esp_hosted_api.c is commented
# out, and the locally-linked libnet80211 has no radio behind it). We
# bridge it via this additive channel — host calls
# esp_hosted_send_custom_data(AVB_RPC_MSG_SET_VENDOR_IE_REQ, ...), the
# slave's avb_custom_rpc.c handler invokes esp_wifi_set_vendor_ie()
# locally on the C6. Default upstream is y, set explicitly here to
# pin the value.
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=4

# FreeRTOS / EMAC settings cloned from the example.
CONFIG_FREERTOS_ISR_STACKSIZE=6144
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ETH_TRANSMIT_MUTEX=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_ETH_IRAM_OPTIMIZATION=y
CONFIG_ETH_DMA_RX_BUFFER_NUM=30
CONFIG_ESP_NETIF_L2_TAP_RX_QUEUE_SIZE=64
CONFIG_ETH_DMA_BUFFER_SIZE=1536
